tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1946_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16LF1946_H_
#define _PIC16LF1946_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define SEG33                         36
#define AN0                           37
#define RA0                           38
#define CPS0                          39
#define SEG18                         40
#define AN1                           41
#define RA1                           42
#define CPS1                          43
#define SEG34                         44
#define AN2                           45
#define VREFM                         46
#define RA2                           47
#define CPS2                          48
#define SEG35                         49
#define AN3                           50
#define RA3                           51
#define VREFP                         52
#define CPS3                          53
#define SEG14                         54
#define T0CKI                         55
#define RA4                           56
#define AN4                           57
#define SEG15                         58
#define RA5                           59
#define CPS4                          60
#define CLKOUT                        61
#define SEG36                         62
#define RA6                           63
#define OSC2                          64
#define CLKIN                         65
#define SEG37                         66
#define OSC1                          67
#define RA7                           68
#define PORTB                         69
#define SEG30                         70
#define RB0                           71
#define SRI                           72
#define FLT0                          73
#define SEG8                          74
#define RB1                           75
#define SEG9                          76
#define RB2                           77
#define RB3                           78
#define SEG10                         79
#define SEG11                         80
#define RB4                           81
#define T1G                           82
#define RB5                           83
#define SEG29                         84
#define RB6                           85
#define SEG38                         86
#define SEG39                         87
#define RB7                           88
#define PORTC                         89
#define SEG40                         90
#define T1CKI                         91
#define T1OSO                         92
#define RC0                           93
#define PORTC_CCP2                    94
#define SEG32                         95
#define T1OSI                         96
#define RC1                           97
#define PORTC_P2A                     98
#define SEG13                         99
#define CCP1                          100
#define P1A                           101
#define RC2                           102
#define SEG17                         103
#define SCK1                          104
#define SCL1                          105
#define RC3                           106
#define SEG16                         107
#define SDI1                          108
#define SDA1                          109
#define RC4                           110
#define SEG12                         111
#define SDO1                          112
#define RC5                           113
#define SEG27                         114
#define TX1                           115
#define RC6                           116
#define CK1                           117
#define RX1                           118
#define SEG28                         119
#define RC7                           120
#define DT1                           121
#define PORTD                         122
#define RD0                           123
#define PORTD_P2D                     124
#define SEG0                          125
#define RD1                           126
#define PORTD_P2C                     127
#define SEG1                          128
#define RD2                           129
#define PORTD_P2B                     130
#define SEG2                          131
#define RD3                           132
#define SEG3                          133
#define PORTD_P3C                     134
#define RD4                           135
#define SDO2                          136
#define SEG4                          137
#define PORTD_P3B                     138
#define RD5                           139
#define SDI2                          140
#define SDA2                          141
#define PORTD_P1C                     142
#define SEG5                          143
#define SCK2                          144
#define RD6                           145
#define SCL2                          146
#define PORTD_P1B                     147
#define SEG6                          148
#define RD7                           149
#define nSS2                          150
#define SEG7                          151
#define PORTE                         152
#define VLCD1                         153
#define PORTE_P2D                     154
#define RE0                           155
#define PORTE_P2C                     156
#define VLCD2                         157
#define RE1                           158
#define VLCD3                         159
#define PORTE_P2B                     160
#define RE2                           161
#define COM0                          162
#define PORTE_P3C                     163
#define RE3                           164
#define COM1                          165
#define PORTE_P3B                     166
#define RE4                           167
#define COM2                          168
#define PORTE_P1C                     169
#define RE5                           170
#define COM3                          171
#define PORTE_P1B                     172
#define RE6                           173
#define SEG31                         174
#define PORTE_P2A                     175
#define PORTE_CCP2                    176
#define RE7                           177
#define PIR1                          178
#define TMR1IF                        179
#define TMR2IF                        180
#define CCP1IF                        181
#define SSPIF                         182
#define SSP1IF                        183
#define TXIF                          184
#define TX1IF                         185
#define RCIF                          186
#define RC1IF                         187
#define ADIF                          188
#define TMR1GIF                       189
#define PIR2                          190
#define CCP2IF                        191
#define C3IF                          192
#define LCDIF                         193
#define BCLIF                         194
#define EEIF                          195
#define C1IF                          196
#define C2IF                          197
#define OSFIF                         198
#define PIR3                          199
#define TMR4IF                        200
#define TMR6IF                        201
#define CCP3IF                        202
#define CCP4IF                        203
#define CCP5IF                        204
#define PIR4                          205
#define SSP2IF                        206
#define BCL2IF                        207
#define TX2IF                         208
#define RC2IF                         209
#define TMR0                          210
#define TMR1L                         211
#define TMR1H                         212
#define T1CON                         213
#define TMR1ON                        214
#define nT1SYNC                       215
#define T1OSCEN                       216
#define T1CKPS0                       217
#define T1CKPS                        218
#define T1CKPS1                       219
#define TMR1CS                        220
#define TMR1CS0                       221
#define TMR1CS1                       222
#define T1GCON                        223
#define T1GSS0                        224
#define T1GSS                         225
#define T1GSS1                        226
#define T1GVAL                        227
#define T1GGO_nDONE                   228
#define T1GGO                         229
#define T1GSPM                        230
#define T1GTM                         231
#define T1GPOL                        232
#define TMR1GE                        233
#define TMR2                          234
#define PR2                           235
#define T2CON                         236
#define T2CKPS0                       237
#define T2CON_T2CKPS                  238
#define T2CKPS1                       239
#define TMR2ON                        240
#define T2OUTPS0                      241
#define T2CON_T2OUTPS                 242
#define T2OUTPS1                      243
#define T2OUTPS2                      244
#define T2OUTPS3                      245
#define CPSCON0                       246
#define T0XCS                         247
#define CPSOUT                        248
#define CPSRNG                        249
#define CPSRNG0                       250
#define CPSRNG1                       251
#define CPSRM                         252
#define CPSON                         253
#define CPSCON1                       254
#define CPSCH                         255
#define CPSCH0                        256
#define CPSCH1                        257
#define CPSCH2                        258
#define CPSCH3                        259
#define CPSCH4                        260
#define TRISA                         261
#define TRISA0                        262
#define TRISA1                        263
#define TRISA2                        264
#define TRISA3                        265
#define TRISA4                        266
#define TRISA5                        267
#define TRISA6                        268
#define TRISA7                        269
#define TRISB                         270
#define TRISB0                        271
#define TRISB1                        272
#define TRISB2                        273
#define TRISB3                        274
#define TRISB4                        275
#define TRISB5                        276
#define TRISB6                        277
#define TRISB7                        278
#define TRISC                         279
#define TRISC0                        280
#define TRISC1                        281
#define TRISC2                        282
#define TRISC3                        283
#define TRISC4                        284
#define TRISC5                        285
#define TRISC6                        286
#define TRISC7                        287
#define TRISD                         288
#define TRISD0                        289
#define TRISD1                        290
#define TRISD2                        291
#define TRISD3                        292
#define TRISD4                        293
#define TRISD5                        294
#define TRISD6                        295
#define TRISD7                        296
#define TRISE                         297
#define TRISE0                        298
#define TRISE1                        299
#define TRISE2                        300
#define TRISE3                        301
#define TRISE4                        302
#define TRISE5                        303
#define TRISE6                        304
#define TRISE7                        305
#define PIE1                          306
#define TMR1IE                        307
#define TMR2IE                        308
#define CCP1IE                        309
#define SSP1IE                        310
#define SSPIE                         311
#define TXIE                          312
#define TX1IE                         313
#define RC1IE                         314
#define RCIE                          315
#define ADIE                          316
#define TMR1GIE                       317
#define PIE2                          318
#define CCP2IE                        319
#define C3IE                          320
#define LCDIE                         321
#define BCLIE                         322
#define EEIE                          323
#define C1IE                          324
#define C2IE                          325
#define OSFIE                         326
#define PIE3                          327
#define TMR4IE                        328
#define TMR6IE                        329
#define CCP3IE                        330
#define CCP4IE                        331
#define CCP5IE                        332
#define PIE4                          333
#define SSP2IE                        334
#define BCL2IE                        335
#define TX2IE                         336
#define RC2IE                         337
#define OPTION_REG                    338
#define PS                            339
#define PS0                           340
#define PS1                           341
#define PS2                           342
#define PSA                           343
#define T0SE                          344
#define TMR0SE                        345
#define T0CS                          346
#define TMR0CS                        347
#define INTEDG                        348
#define nWPUEN                        349
#define PCON                          350
#define nBOR                          351
#define nPOR                          352
#define nRI                           353
#define nRMCLR                        354
#define STKUNF                        355
#define STKOVF                        356
#define WDTCON                        357
#define SWDTEN                        358
#define WDTPS                         359
#define WDTPS0                        360
#define WDTPS1                        361
#define WDTPS2                        362
#define WDTPS3                        363
#define WDTPS4                        364
#define OSCTUNE                       365
#define TUN0                          366
#define TUN                           367
#define TUN1                          368
#define TUN2                          369
#define TUN3                          370
#define TUN4                          371
#define TUN5                          372
#define OSCCON                        373
#define SCS0                          374
#define SCS                           375
#define SCS1                          376
#define IRCF                          377
#define IRCF0                         378
#define IRCF1                         379
#define IRCF2                         380
#define IRCF3                         381
#define SPLLEN                        382
#define OSCSTAT                       383
#define HFIOFS                        384
#define LFIOFR                        385
#define MFIOFR                        386
#define HFIOFL                        387
#define HFIOFR                        388
#define OSTS                          389
#define PLLR                          390
#define T1OSCR                        391
#define ADRESL                        392
#define ADRESH                        393
#define ADCON0                        394
#define ADON                          395
#define nDONE                         396
#define GO_nDONE                      397
#define GO                            398
#define ADGO                          399
#define CHS0                          400
#define CHS                           401
#define CHS1                          402
#define CHS2                          403
#define CHS3                          404
#define CHS4                          405
#define ADCON1                        406
#define ADPREF0                       407
#define ADPREF                        408
#define ADPREF1                       409
#define ADNREF                        410
#define ADCS0                         411
#define ADCS                          412
#define ADCS1                         413
#define ADCS2                         414
#define ADFM                          415
#define LATA                          416
#define LATA0                         417
#define LATA1                         418
#define LATA2                         419
#define LATA3                         420
#define LATA4                         421
#define LATA5                         422
#define LATA6                         423
#define LATA7                         424
#define LATB                          425
#define LATB0                         426
#define LATB1                         427
#define LATB2                         428
#define LATB3                         429
#define LATB4                         430
#define LATB5                         431
#define LATB6                         432
#define LATB7                         433
#define LATC                          434
#define LATC0                         435
#define LATC1                         436
#define LATC2                         437
#define LATC3                         438
#define LATC4                         439
#define LATC5                         440
#define LATC6                         441
#define LATC7                         442
#define LATD0                         443
#define LATD                          444
#define LATD1                         445
#define LATD2                         446
#define LATD3                         447
#define LATD4                         448
#define LATD5                         449
#define LATD6                         450
#define LATD7                         451
#define LATE                          452
#define LATE0                         453
#define LATE1                         454
#define LATE2                         455
#define LATE3                         456
#define LATE4                         457
#define LATE5                         458
#define LATE6                         459
#define LATE7                         460
#define CM1CON0                       461
#define C1SYNC                        462
#define C1HYS                         463
#define C1SP                          464
#define C1POL                         465
#define C1OE                          466
#define CM1CON0_C1OUT                 467
#define C1ON                          468
#define CM1CON1                       469
#define C1NCH0                        470
#define C1NCH                         471
#define C1NCH1                        472
#define C1PCH                         473
#define C1PCH0                        474
#define C1PCH1                        475
#define C1INTN                        476
#define C1INTP                        477
#define CM2CON0                       478
#define C2SYNC                        479
#define C2HYS                         480
#define C2SP                          481
#define C2POL                         482
#define C2OE                          483
#define CM2CON0_C2OUT                 484
#define C2ON                          485
#define CM2CON1                       486
#define C2NCH0                        487
#define C2NCH                         488
#define C2NCH1                        489
#define C2PCH                         490
#define C2PCH0                        491
#define C2PCH1                        492
#define C2INTN                        493
#define C2INTP                        494
#define CMOUT                         495
#define MC1OUT                        496
#define MC2OUT                        497
#define MC3OUT                        498
#define BORCON                        499
#define BORRDY                        500
#define SBOREN                        501
#define FVRCON                        502
#define ADFVR0                        503
#define ADFVR                         504
#define ADFVR1                        505
#define CDAFVR0                       506
#define CDAFVR                        507
#define CDAFVR1                       508
#define FVRRDY                        509
#define FVREN                         510
#define DACCON0                       511
#define DACNSS                        512
#define DACPSS                        513
#define DACPSS0                       514
#define DACPSS1                       515
#define DACOE                         516
#define DACLPS                        517
#define DACEN                         518
#define DACCON1                       519
#define DACR0                         520
#define DACR                          521
