tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1946_tdd.h
#define DACR1                         522
#define DACR2                         523
#define DACR3                         524
#define DACR4                         525
#define SRCON0                        526
#define SRPR                          527
#define SRPS                          528
#define SRNQEN                        529
#define SRQEN                         530
#define SRCLK0                        531
#define SRCLK                         532
#define SRCLK1                        533
#define SRCLK2                        534
#define SRLEN                         535
#define SRCON1                        536
#define SRRC1E                        537
#define SRRC2E                        538
#define SRRCKE                        539
#define SRRPE                         540
#define SRSC1E                        541
#define SRSC2E                        542
#define SRSCKE                        543
#define SRSPE                         544
#define APFCON                        545
#define P1BSEL                        546
#define P1CSEL                        547
#define CCP2SEL                       548
#define P2BSEL                        549
#define P2CSEL                        550
#define P2DSEL                        551
#define P3BSEL                        552
#define P3CSEL                        553
#define CM3CON0                       554
#define C3SYNC                        555
#define C3HYS                         556
#define C3SP                          557
#define C3POL                         558
#define C3OE                          559
#define CM3CON0_C3OUT                 560
#define C3ON                          561
#define CM3CON1                       562
#define C3NCH                         563
#define C3NCH0                        564
#define C3NCH1                        565
#define C3PCH                         566
#define C3PCH0                        567
#define C3PCH1                        568
#define C3INTN                        569
#define C3INTP                        570
#define ANSA0                         571
#define ANSELA                        572
#define ANSA1                         573
#define ANSA2                         574
#define ANSA3                         575
#define ANSA5                         576
#define ANSELE                        577
#define ANSE0                         578
#define ANSE1                         579
#define ANSE2                         580
#define EEADRL                        581
#define EEADRH                        582
#define EEDATL                        583
#define EEDATH                        584
#define EECON1                        585
#define RD                            586
#define WR                            587
#define WREN                          588
#define WRERR                         589
#define FREE                          590
#define LWLO                          591
#define CFGS                          592
#define EEPGD                         593
#define EECON2                        594
#define RC1REG                        595
#define RC1REG_RCREG                  596
#define TX1REG                        597
#define TX1REG_TXREG                  598
#define SP1BRGL                       599
#define SP1BRGL_SPBRGL                600
#define SP1BRGH                       601
#define SP1BRGH_SPBRGH                602
#define RC1STA                        603
#define RC1STA_RX9D                   604
#define RC1STA_OERR                   605
#define RC1STA_FERR                   606
#define RC1STA_ADDEN                  607
#define RC1STA_CREN                   608
#define RC1STA_SREN                   609
#define RC1STA_RX9                    610
#define RC1STA_SPEN                   611
#define TX1STA                        612
#define TX1STA_TX9D                   613
#define TX1STA_TRMT                   614
#define TX1STA_BRGH                   615
#define TX1STA_SENDB                  616
#define TX1STA_SYNC                   617
#define TX1STA_TXEN                   618
#define TX1STA_TX9                    619
#define TX1STA_CSRC                   620
#define BAUD1CON                      621
#define BAUD1CON_ABDEN                622
#define BAUD1CON_WUE                  623
#define BAUD1CON_BRG16                624
#define BAUD1CON_SCKP                 625
#define BAUD1CON_RCIDL                626
#define BAUD1CON_ABDOVF               627
#define WPUB0                         628
#define WPUB                          629
#define WPUB1                         630
#define WPUB2                         631
#define WPUB3                         632
#define WPUB4                         633
#define WPUB5                         634
#define WPUB6                         635
#define WPUB7                         636
#define SSP1BUF                       637
#define SSP1BUF_SSPBUF                638
#define SSP1ADD                       639
#define SSP1ADD_SSPADD                640
#define SSP1MSK                       641
#define SSP1MSK_SSPMSK                642
#define SSP1STAT                      643
#define SSP1STAT_BF                   644
#define SSP1STAT_UA                   645
#define SSP1STAT_R_nW                 646
#define SSP1STAT_S                    647
#define SSP1STAT_P                    648
#define SSP1STAT_D_nA                 649
#define SSP1STAT_CKE                  650
#define SSP1STAT_SMP                  651
#define SSP1CON1                      652
#define SSP1CON1_SSPM0                653
#define SSP1CON1_SSPM1                654
#define SSP1CON1_SSPM2                655
#define SSP1CON1_SSPM3                656
#define SSP1CON1_CKP                  657
#define SSP1CON1_SSPEN                658
#define SSP1CON1_SSPOV                659
#define SSP1CON1_WCOL                 660
#define SSP1CON2                      661
#define SSP1CON2_SEN                  662
#define SSP1CON2_RSEN                 663
#define SSP1CON2_PEN                  664
#define SSP1CON2_RCEN                 665
#define SSP1CON2_ACKEN                666
#define SSP1CON2_ACKDT                667
#define SSP1CON2_ACKSTAT              668
#define SSP1CON2_GCEN                 669
#define SSP1CON3                      670
#define SSP1CON3_DHEN                 671
#define SSP1CON3_AHEN                 672
#define SSP1CON3_SBCDE                673
#define SSP1CON3_SDAHT                674
#define SSP1CON3_BOEN                 675
#define SSP1CON3_SCIE                 676
#define SSP1CON3_PCIE                 677
#define SSP1CON3_ACKTIM               678
#define SSP2BUF                       679
#define SSP2BUF_SSPBUF                680
#define SSP2ADD                       681
#define SSP2ADD_SSPADD                682
#define SSP2MSK                       683
#define SSP2MSK_SSPMSK                684
#define SSP2STAT                      685
#define SSP2STAT_BF                   686
#define SSP2STAT_UA                   687
#define SSP2STAT_R_nW                 688
#define SSP2STAT_S                    689
#define SSP2STAT_P                    690
#define SSP2STAT_D_nA                 691
#define SSP2STAT_CKE                  692
#define SSP2STAT_SMP                  693
#define SSP2CON1                      694
#define SSP2CON1_SSPM0                695
#define SSP2CON1_SSPM1                696
#define SSP2CON1_SSPM2                697
#define SSP2CON1_SSPM3                698
#define SSP2CON1_CKP                  699
#define SSP2CON1_SSPEN                700
#define SSP2CON1_SSPOV                701
#define SSP2CON1_WCOL                 702
#define SSP2CON2                      703
#define SSP2CON2_SEN                  704
#define SSP2CON2_RSEN                 705
#define SSP2CON2_PEN                  706
#define SSP2CON2_RCEN                 707
#define SSP2CON2_ACKEN                708
#define SSP2CON2_ACKDT                709
#define SSP2CON2_ACKSTAT              710
#define SSP2CON2_GCEN                 711
#define SSP2CON3                      712
#define SSP2CON3_DHEN                 713
#define SSP2CON3_AHEN                 714
#define SSP2CON3_SBCDE                715
#define SSP2CON3_SDAHT                716
#define SSP2CON3_BOEN                 717
#define SSP2CON3_SCIE                 718
#define SSP2CON3_PCIE                 719
#define SSP2CON3_ACKTIM               720
#define PORTF                         721
#define CPS16                         722
#define RF0                           723
#define SEG41                         724
#define C2IN0N                        725
#define C1IN0N                        726
#define AN16                          727
#define SEG19                         728
#define AN6                           729
#define PORTF_C2OUT                   730
#define RF1                           731
#define SRNQ                          732
#define CPS6                          733
#define AN7                           734
#define RF2                           735
#define PORTF_C1OUT                   736
#define SEG20                         737
#define SRQ                           738
#define CPS7                          739
#define AN8                           740
#define RF3                           741
#define SEG21                         742
#define C3IN2N                        743
#define C2IN2N                        744
#define C1IN2N                        745
#define CPS8                          746
#define AN9                           747
#define RF4                           748
#define SEG22                         749
#define C2INP                         750
#define CPS9                          751
#define C2IN1N                        752
#define CPS10                         753
#define RF5                           754
#define C1IN1N                        755
#define SEG23                         756
#define DACOUT                        757
#define AN10                          758
#define C1INP                         759
#define CPS11                         760
#define RF6                           761
#define SEG24                         762
#define AN11                          763
#define C2IN3N                        764
#define C3IN3N                        765
#define AN5                           766
#define C1IN3N                        767
#define RF7                           768
#define SEG25                         769
#define CPS5                          770
#define PORTG                         771
#define CCP3                          772
#define SEG42                         773
#define P3A                           774
#define RG0                           775
#define CPS15                         776
#define SEG43                         777
#define AN15                          778
#define PORTG_C3OUT                   779
#define TX2                           780
#define RG1                           781
#define CK2                           782
#define CPS14                         783
#define C3INP                         784
#define SEG44                         785
#define RX2                           786
#define RG2                           787
#define AN14                          788
#define DT2                           789
#define CPS13                         790
#define CCP4                          791
#define SEG45                         792
#define C3IN0N                        793
#define P3D                           794
#define RG3                           795
#define AN13                          796
#define C3IN1N                        797
#define CPS12                         798
#define CCP5                          799
#define SEG26                         800
#define P1D                           801
#define RG4                           802
#define AN12                          803
#define RG5                           804
#define nMCLR                         805
#define CCPR1L                        806
#define CCPR1H                        807
#define CCP1CON                       808
#define CCP1M0                        809
#define CCP1M                         810
#define CCP1M1                        811
#define CCP1M2                        812
#define CCP1M3                        813
#define DC1B                          814
#define DC1B0                         815
#define DC1B1                         816
#define P1M                           817
#define P1M0                          818
#define P1M1                          819
#define PWM1CON                       820
#define P1DC0                         821
#define P1DC1                         822
#define P1DC2                         823
#define P1DC3                         824
#define P1DC4                         825
#define P1DC5                         826
#define P1DC6                         827
#define P1RSEN                        828
#define CCP1AS                        829
#define PSS1BD0                       830
#define PSS1BD1                       831
#define PSS1AC0                       832
#define PSS1AC1                       833
#define CCP1AS0                       834
#define CCP1AS1                       835
#define CCP1AS2                       836
#define CCP1ASE                       837
#define PSTR1CON                      838
#define STR1A                         839
#define STR1B                         840
#define STR1C                         841
#define STR1D                         842
#define STR1SYNC                      843
#define CCPR2L                        844
#define CCPR2H                        845
#define CCP2CON                       846
#define CCP2M                         847
#define CCP2M0                        848
#define CCP2M1                        849
#define CCP2M2                        850
#define CCP2M3                        851
#define DC2B                          852
#define DC2B0                         853
#define DC2B1                         854
#define P2M                           855
#define P2M0                          856
#define P2M1                          857
#define PWM2CON                       858
#define P2DC0                         859
#define P2DC1                         860
#define P2DC2                         861
#define P2DC3                         862
#define P2DC4                         863
#define P2DC5                         864
#define P2DC6                         865
#define P2RSEN                        866
#define CCP2AS                        867
#define PSS2BD0                       868
#define PSS2BD1                       869
#define PSS2AC0                       870
#define PSS2AC1                       871
#define CCP2AS0                       872
#define CCP2AS1                       873
#define CCP2AS2                       874
#define CCP2ASE                       875
#define PSTR2CON                      876
#define STR2A                         877
#define STR2B                         878
#define STR2C                         879
#define STR2D                         880
#define STR2SYNC                      881
#define CCPTMRS0                      882
#define C1TSEL0                       883
#define C1TSEL                        884
#define C1TSEL1                       885
#define C2TSEL0                       886
#define C2TSEL                        887
#define C2TSEL1                       888
#define C3TSEL0                       889
#define C3TSEL                        890
#define C3TSEL1                       891
#define C4TSEL                        892
#define C4TSEL0                       893
#define C4TSEL1                       894
#define CCPTMRS1                      895
#define C5TSEL                        896
#define C5TSEL0                       897
#define C5TSEL1                       898
#define TRISF                         899
#define TRISF0                        900
#define TRISF1                        901
#define TRISF2                        902
#define TRISF3                        903
#define TRISF4                        904
#define TRISF5                        905
#define TRISF6                        906
#define TRISF7                        907
#define TRISG                         908
#define TRISG0                        909
#define TRISG1                        910
#define TRISG2                        911
#define TRISG3                        912
#define TRISG4                        913
#define TRISG5                        914
#define CCPR3L                        915
#define CCPR3H                        916
#define CCP3CON                       917
#define CCP3M0                        918
#define CCP3M1                        919
#define CCP3M2                        920
#define CCP3M3                        921
#define DC3B0                         922
#define DC3B1                         923
#define P3M0                          924
#define P3M1                          925
#define PWM3CON                       926
#define P3DC0                         927
#define P3DC1                         928
#define P3DC2                         929
#define P3DC3                         930
#define P3DC4                         931
#define P3DC5                         932
#define P3DC6                         933
#define P3RSEN                        934
#define CCP3AS                        935
#define PSS3BD0                       936
#define PSS3BD1                       937
#define PSS3AC0                       938
#define PSS3AC1                       939
#define CCP3AS0                       940
#define CCP3AS1                       941
#define CCP3AS2                       942
#define CCP3ASE                       943
#define PSTR3CON                      944
#define STR3A                         945
#define STR3B                         946
#define STR3C                         947
#define STR3D                         948
#define STR3SYNC                      949
#define CCPR4L                        950
#define CCPR4H                        951
#define CCP4CON                       952
#define CCP4M0                        953
#define CCP4M1                        954
#define CCP4M2                        955
#define CCP4M3                        956
#define DC4B0                         957
#define DC4B1                         958
#define CCPR5L                        959
#define CCPR5H                        960
#define CCP5CON                       961
#define CCP5M0                        962
#define CCP5M1                        963
#define CCP5M2                        964
#define CCP5M3                        965
#define DC5B0                         966
#define DC5B1                         967
#define LATF                          968
#define LATF0                         969
#define LATF1                         970
#define LATF2                         971
#define LATF3                         972
#define LATF4                         973
#define LATF5                         974
#define LATF6                         975
#define LATF7                         976
#define LATG                          977
#define LATG0                         978
#define LATG1                         979
#define LATG2                         980
#define LATG3                         981
#define LATG4                         982
#define LATG5                         983
#define IOCBP                         984
#define IOCBP0                        985
#define IOCBP1                        986
#define IOCBP2                        987
#define IOCBP3                        988
#define IOCBP4                        989
#define IOCBP5                        990
#define IOCBP6                        991
#define IOCBP7                        992
#define IOCBN0                        993
#define IOCBN                         994
#define IOCBN1                        995
#define IOCBN2                        996
#define IOCBN3                        997
#define IOCBN4                        998
#define IOCBN5                        999
#define IOCBN6                        1000
#define IOCBN7                        1001
#define IOCBF0                        1002
#define IOCBF                         1003
#define IOCBF1                        1004
#define IOCBF2                        1005
#define IOCBF3                        1006
#define IOCBF4                        1007
#define IOCBF5                        1008
#define IOCBF6                        1009
#define IOCBF7                        1010
#define ANSELF                        1011
#define ANSF0                         1012
#define ANSF1                         1013
#define ANSF2                         1014
#define ANSF3                         1015
#define ANSF4                         1016
#define ANSF5                         1017
#define ANSF6                         1018
#define ANSF7                         1019
#define ANSELG                        1020
#define ANSG1                         1021
#define ANSG2                         1022
#define ANSG3                         1023
#define ANSG4                         1024
#define TMR4                          1025
#define PR4                           1026
#define T4CON                         1027
#define T4CKPS0                       1028
#define T4CKPS                        1029
#define T4CKPS1                       1030
#define TMR4ON                        1031
#define T4OUTPS                       1032
#define T4OUTPS0                      1033
#define T4OUTPS1                      1034
#define T4OUTPS2                      1035
#define T4OUTPS3                      1036
#define TMR6                          1037
#define PR6                           1038
#define T6CON                         1039
#define T6CKPS0                       1040
#define T6CON_T2CKPS                  1041
#define T6CKPS1                       1042
#define TMR6ON                        1043
#define T6OUTPS0                      1044
#define T6CON_T2OUTPS                 1045
#define T6OUTPS1                      1046
#define T6OUTPS2                      1047
#define T6OUTPS3                      1048
#define WPUG                          1049
#define WPUG5                         1050
#define RC2REG                        1051
#define RC2REG_RCREG                  1052
#define TX2REG                        1053
#define TX2REG_TXREG                  1054
#define SP2BRGL                       1055
#define SP2BRGL_SPBRGL                1056
#define SP2BRGH                       1057
#define SP2BRGH_SPBRGH                1058
#define RC2STA                        1059
#define RC2STA_RX9D                   1060
#define RC2STA_OERR                   1061
#define RC2STA_FERR                   1062
#define RC2STA_ADDEN                  1063
#define RC2STA_CREN                   1064
#define RC2STA_SREN                   1065
#define RC2STA_RX9                    1066
#define RC2STA_SPEN                   1067
#define TX2STA                        1068
#define TX2STA_TX9D                   1069
#define TX2STA_TRMT                   1070
#define TX2STA_BRGH                   1071
#define TX2STA_SENDB                  1072
#define TX2STA_SYNC                   1073
#define TX2STA_TXEN                   1074
#define TX2STA_TX9                    1075
#define TX2STA_CSRC                   1076
#define BAUD2CON                      1077
#define BAUD2CON_ABDEN                1078
#define BAUD2CON_WUE                  1079
#define BAUD2CON_BRG16                1080
#define BAUD2CON_SCKP                 1081
#define BAUD2CON_RCIDL                1082
#define BAUD2CON_ABDOVF               1083
#define LCDCON                        1084
#define LMUX0                         1085
#define LMUX                          1086
#define LMUX1                         1087
#define CS                            1088
#define CS0                           1089
#define CS1                           1090
