tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1946_tdd.h
#define WERR                          1091
#define SLPEN                         1092
#define LCDEN                         1093
#define LCDPS                         1094
#define LP                            1095
#define LP0                           1096
#define LP1                           1097
#define LP2                           1098
#define LP3                           1099
#define WA                            1100
#define LCDA                          1101
#define BIASMD                        1102
#define WFT                           1103
#define LCDREF                        1104
#define VLCD1PE                       1105
#define VLCD2PE                       1106
#define VLCD3PE                       1107
#define LCDIRI                        1108
#define LCDIRS                        1109
#define LCDIRE                        1110
#define LCDCST0                       1111
#define LCDCST                        1112
#define LCDCST1                       1113
#define LCDCST2                       1114
#define LCDRL                         1115
#define LRLAT0                        1116
#define LRLAT                         1117
#define LRLAT1                        1118
#define LRLAT2                        1119
#define LRLBP                         1120
#define LRLBP0                        1121
#define LRLBP1                        1122
#define LRLAP0                        1123
#define LRLAP                         1124
#define LRLAP1                        1125
#define LCDSE0                        1126
#define SE0                           1127
#define SE1                           1128
#define SE2                           1129
#define SE3                           1130
#define SE4                           1131
#define SE5                           1132
#define SE6                           1133
#define SE7                           1134
#define LCDSE1                        1135
#define SE8                           1136
#define SE9                           1137
#define SE10                          1138
#define SE11                          1139
#define SE12                          1140
#define SE13                          1141
#define SE14                          1142
#define SE15                          1143
#define LCDSE2                        1144
#define SE16                          1145
#define SE17                          1146
#define SE18                          1147
#define SE19                          1148
#define SE20                          1149
#define SE21                          1150
#define SE22                          1151
#define SE23                          1152
#define LCDSE3                        1153
#define SE24                          1154
#define SE25                          1155
#define SE26                          1156
#define SE27                          1157
#define SE28                          1158
#define SE29                          1159
#define SE30                          1160
#define SE31                          1161
#define LCDSE4                        1162
#define SE32                          1163
#define SE33                          1164
#define SE34                          1165
#define SE35                          1166
#define SE36                          1167
#define SE37                          1168
#define SE38                          1169
#define SE39                          1170
#define LCDSE5                        1171
#define SE40                          1172
#define SE41                          1173
#define SE42                          1174
#define SE43                          1175
#define SE44                          1176
#define SE45                          1177
#define LCDDATA0                      1178
#define SEG0COM0                      1179
#define SEG1COM0                      1180
#define SEG2COM0                      1181
#define SEG3COM0                      1182
#define SEG4COM0                      1183
#define SEG5COM0                      1184
#define SEG6COM0                      1185
#define SEG7COM0                      1186
#define LCDDATA1                      1187
#define SEG8COM0                      1188
#define SEG9COM0                      1189
#define SEG10COM0                     1190
#define SEG11COM0                     1191
#define SEG12COM0                     1192
#define SEG13COM0                     1193
#define SEG14COM0                     1194
#define SEG15COM0                     1195
#define LCDDATA2                      1196
#define SEG16COM0                     1197
#define SEG17COM0                     1198
#define SEG18COM0                     1199
#define SEG19COM0                     1200
#define SEG20COM0                     1201
#define SEG21COM0                     1202
#define SEG22COM0                     1203
#define SEG23COM0                     1204
#define LCDDATA3                      1205
#define SEG0COM1                      1206
#define SEG1COM1                      1207
#define SEG2COM1                      1208
#define SEG3COM1                      1209
#define SEG4COM1                      1210
#define SEG5COM1                      1211
#define SEG6COM1                      1212
#define SEG7COM1                      1213
#define LCDDATA4                      1214
#define SEG8COM1                      1215
#define SEG9COM1                      1216
#define SEG10COM1                     1217
#define SEG11COM1                     1218
#define SEG12COM1                     1219
#define SEG13COM1                     1220
#define SEG14COM1                     1221
#define SEG15COM1                     1222
#define LCDDATA5                      1223
#define SEG16COM1                     1224
#define SEG17COM1                     1225
#define SEG18COM1                     1226
#define SEG19COM1                     1227
#define SEG20COM1                     1228
#define SEG21COM1                     1229
#define SEG22COM1                     1230
#define SEG23COM1                     1231
#define LCDDATA6                      1232
#define SEG0COM2                      1233
#define SEG1COM2                      1234
#define SEG2COM2                      1235
#define SEG3COM2                      1236
#define SEG4COM2                      1237
#define SEG5COM2                      1238
#define SEG6COM2                      1239
#define SEG7COM2                      1240
#define LCDDATA7                      1241
#define SEG8COM2                      1242
#define SEG9COM2                      1243
#define SEG10COM2                     1244
#define SEG11COM2                     1245
#define SEG12COM2                     1246
#define SEG13COM2                     1247
#define SEG14COM2                     1248
#define SEG15COM2                     1249
#define LCDDATA8                      1250
#define SEG16COM2                     1251
#define SEG17COM2                     1252
#define SEG18COM2                     1253
#define SEG19COM2                     1254
#define SEG20COM2                     1255
#define SEG21COM2                     1256
#define SEG22COM2                     1257
#define SEG23COM2                     1258
#define LCDDATA9                      1259
#define SEG0COM3                      1260
#define SEG1COM3                      1261
#define SEG2COM3                      1262
#define SEG3COM3                      1263
#define SEG4COM3                      1264
#define SEG5COM3                      1265
#define SEG6COM3                      1266
#define SEG7COM3                      1267
#define LCDDATA10                     1268
#define SEG8COM3                      1269
#define SEG9COM3                      1270
#define SEG10COM3                     1271
#define SEG11COM3                     1272
#define SEG12COM3                     1273
#define SEG13COM3                     1274
#define SEG14COM3                     1275
#define SEG15COM3                     1276
#define LCDDATA11                     1277
#define SEG16COM3                     1278
#define SEG17COM3                     1279
#define SEG18COM3                     1280
#define SEG19COM3                     1281
#define SEG20COM3                     1282
#define SEG21COM3                     1283
#define SEG22COM3                     1284
#define SEG23COM3                     1285
#define LCDDATA12                     1286
#define SEG24COM0                     1287
#define SEG25COM0                     1288
#define SEG26COM0                     1289
#define SEG27COM0                     1290
#define SEG28COM0                     1291
#define SEG29COM0                     1292
#define SEG30COM0                     1293
#define SEG31COM0                     1294
#define LCDDATA13                     1295
#define SEG32COM0                     1296
#define SEG33COM0                     1297
#define SEG34COM0                     1298
#define SEG35COM0                     1299
#define SEG36COM0                     1300
#define SEG37COM0                     1301
#define SEG38COM0                     1302
#define SEG39COM0                     1303
#define LCDDATA14                     1304
#define SEG40COM0                     1305
#define SEG41COM0                     1306
#define SEG42COM0                     1307
#define SEG43COM0                     1308
#define SEG44COM0                     1309
#define SEG45COM0                     1310
#define LCDDATA15                     1311
#define SEG24COM1                     1312
#define SEG25COM1                     1313
#define SEG26COM1                     1314
#define SEG27COM1                     1315
#define SEG28COM1                     1316
#define SEG29COM1                     1317
#define SEG30COM1                     1318
#define SEG31COM1                     1319
#define LCDDATA16                     1320
#define SEG32COM1                     1321
#define SEG33COM1                     1322
#define SEG34COM1                     1323
#define SEG35COM1                     1324
#define SEG36COM1                     1325
#define SEG37COM1                     1326
#define SEG38COM1                     1327
#define SEG39COM1                     1328
#define LCDDATA17                     1329
#define SEG40COM1                     1330
#define SEG41COM1                     1331
#define SEG42COM1                     1332
#define SEG43COM1                     1333
#define SEG44COM1                     1334
#define SEG45COM1                     1335
#define LCDDATA18                     1336
#define SEG24COM2                     1337
#define SEG25COM2                     1338
#define SEG26COM2                     1339
#define SEG27COM2                     1340
#define SEG28COM2                     1341
#define SEG29COM2                     1342
#define SEG30COM2                     1343
#define SEG31COM2                     1344
#define LCDDATA19                     1345
#define SEG32COM2                     1346
#define SEG33COM2                     1347
#define SEG34COM2                     1348
#define SEG35COM2                     1349
#define SEG36COM2                     1350
#define SEG37COM2                     1351
#define SEG38COM2                     1352
#define SEG39COM2                     1353
#define LCDDATA20                     1354
#define SEG40COM2                     1355
#define SEG41COM2                     1356
#define SEG42COM2                     1357
#define SEG43COM2                     1358
#define SEG44COM2                     1359
#define SEG45COM2                     1360
#define LCDDATA21                     1361
#define SEG24COM3                     1362
#define SEG25COM3                     1363
#define SEG26COM3                     1364
#define SEG27COM3                     1365
#define SEG28COM3                     1366
#define SEG29COM3                     1367
#define SEG30COM3                     1368
#define SEG31COM3                     1369
#define LCDDATA22                     1370
#define SEG32COM3                     1371
#define SEG33COM3                     1372
#define SEG34COM3                     1373
#define SEG35COM3                     1374
#define SEG36COM3                     1375
#define SEG37COM3                     1376
#define SEG38COM3                     1377
#define SEG39COM3                     1378
#define LCDDATA23                     1379
#define SEG40COM3                     1380
#define SEG41COM3                     1381
#define SEG42COM3                     1382
#define SEG43COM3                     1383
#define SEG44COM3                     1384
#define SEG45COM3                     1385
#define STATUS_SHAD                   1386
#define C_SHAD                        1387
#define DC_SHAD                       1388
#define Z_SHAD                        1389
#define WREG_SHAD                     1390
#define BSR_SHAD                      1391
#define PCLATH_SHAD                   1392
#define FSR0L_SHAD                    1393
#define FSR0H_SHAD                    1394
#define FSR1L_SHAD                    1395
#define FSR1H_SHAD                    1396
#define STKPTR                        1397
#define TOSL                          1398
#define TOSH                          1399

#endif // _PIC16LF1946_H_
